# StructConnectionColumnTop Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StructConnectionColumnTop Property
ParameterTypeId Class See Also
---
"Top Connection"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StructConnectionColumnTop { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StructConnectionColumnTop As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StructConnectionColumnTop {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace